palette-system/az-macro/firmware/ESP32-NimBLE-Keyboard/BleKeyboard.cpp
#include <NimBLEDevice.h>
#include <NimBLEUtils.h>
#include <NimBLEServer.h>
#include "NimBLEHIDDevice.h"
#include "HIDTypes.h"
#include <driver/adc.h>
#include "sdkconfig.h"

#include "BleConnectionStatus.h"
#include "KeyboardOutputCallbacks.h"
#include "NimBleCallbacks.h"
#include "BleKeyboard.h"

#if defined(CONFIG_ARDUHAL_ESP_LOG)
  #include "esp32-hal-log.h"
  #define LOG_TAG ""
#else
  #include "esp_log.h"
  static const char* LOG_TAG = "NimBLEDevice";
#endif


// Report IDs:
#define KEYBOARD_ID 0x01
#define MEDIA_KEYS_ID 0x02

static const uint8_t _hidReportDescriptor[] PROGMEM = {
  USAGE_PAGE(1),      0x01,          // USAGE_PAGE (Generic Desktop Ctrls)
  USAGE(1),           0x06,          // USAGE (Keyboard)
  COLLECTION(1),      0x01,          // COLLECTION (Application)
  // ------------------------------------------------- Keyboard
  REPORT_ID(1),       KEYBOARD_ID,   //   REPORT_ID (1)
  USAGE_PAGE(1),      0x07,          //   USAGE_PAGE (Kbrd/Keypad)
  USAGE_MINIMUM(1),   0xE0,          //   USAGE_MINIMUM (0xE0)
  USAGE_MAXIMUM(1),   0xE7,          //   USAGE_MAXIMUM (0xE7)
  LOGICAL_MINIMUM(1), 0x00,          //   LOGICAL_MINIMUM (0)
  LOGICAL_MAXIMUM(1), 0x01,          //   Logical Maximum (1)
  REPORT_SIZE(1),     0x01,          //   REPORT_SIZE (1)
  REPORT_COUNT(1),    0x08,          //   REPORT_COUNT (8)
  HIDINPUT(1),        0x02,          //   INPUT (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
  REPORT_COUNT(1),    0x01,          //   REPORT_COUNT (1) ; 1 byte (Reserved)
  REPORT_SIZE(1),     0x08,          //   REPORT_SIZE (8)
  HIDINPUT(1),        0x01,          //   INPUT (Const,Array,Abs,No Wrap,Linear,Preferred State,No Null Position)
  REPORT_COUNT(1),    0x05,          //   REPORT_COUNT (5) ; 5 bits (Num lock, Caps lock, Scroll lock, Compose, Kana)
  REPORT_SIZE(1),     0x01,          //   REPORT_SIZE (1)
  USAGE_PAGE(1),      0x08,          //   USAGE_PAGE (LEDs)
  USAGE_MINIMUM(1),   0x01,          //   USAGE_MINIMUM (0x01) ; Num Lock
  USAGE_MAXIMUM(1),   0x05,          //   USAGE_MAXIMUM (0x05) ; Kana
  HIDOUTPUT(1),       0x02,          //   OUTPUT (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position,Non-volatile)
  REPORT_COUNT(1),    0x01,          //   REPORT_COUNT (1) ; 3 bits (Padding)
  REPORT_SIZE(1),     0x03,          //   REPORT_SIZE (3)
  HIDOUTPUT(1),       0x01,          //   OUTPUT (Const,Array,Abs,No Wrap,Linear,Preferred State,No Null Position,Non-volatile)
  REPORT_COUNT(1),    0x06,          //   REPORT_COUNT (6) ; 6 bytes (Keys)
  REPORT_SIZE(1),     0x08,          //   REPORT_SIZE(8)
  LOGICAL_MINIMUM(1), 0x00,          //   LOGICAL_MINIMUM(0)
  LOGICAL_MAXIMUM(1), 0xEF,          //   LOGICAL_MAXIMUM(0x65) ; 101 keys
  USAGE_PAGE(1),      0x07,          //   USAGE_PAGE (Kbrd/Keypad)
  USAGE_MINIMUM(1),   0x00,          //   USAGE_MINIMUM (0)
  USAGE_MAXIMUM(1),   0xEF,          //   USAGE_MAXIMUM (0x65)
  HIDINPUT(1),        0x00,          //   INPUT (Data,Array,Abs,No Wrap,Linear,Preferred State,No Null Position)
  END_COLLECTION(0),                 // END_COLLECTION
  // ------------------------------------------------- Media Keys
  USAGE_PAGE(1),      0x0C,          // USAGE_PAGE (Consumer)
  USAGE(1),           0x01,          // USAGE (Consumer Control)
  COLLECTION(1),      0x01,          // COLLECTION (Application)
  REPORT_ID(1),       MEDIA_KEYS_ID, //   REPORT_ID (3)
  USAGE_PAGE(1),      0x0C,          //   USAGE_PAGE (Consumer)
  LOGICAL_MINIMUM(1), 0x00,          //   LOGICAL_MINIMUM (0)
  LOGICAL_MAXIMUM(1), 0x01,          //   LOGICAL_MAXIMUM (1)
  REPORT_SIZE(1),     0x01,          //   REPORT_SIZE (1)
  REPORT_COUNT(1),    0x10,          //   REPORT_COUNT (16)
  USAGE(1),           0xB5,          //   USAGE (Scan Next Track)     ; bit 0: 1
  USAGE(1),           0xB6,          //   USAGE (Scan Previous Track) ; bit 1: 2
  USAGE(1),           0xB7,          //   USAGE (Stop)                ; bit 2: 4
  USAGE(1),           0xCD,          //   USAGE (Play/Pause)          ; bit 3: 8
  USAGE(1),           0xE2,          //   USAGE (Mute)                ; bit 4: 16
  USAGE(1),           0xE9,          //   USAGE (Volume Increment)    ; bit 5: 32
  USAGE(1),           0xEA,          //   USAGE (Volume Decrement)    ; bit 6: 64
  USAGE(2),           0x23, 0x02,    //   Usage (WWW Home)            ; bit 7: 128
  USAGE(2),           0x94, 0x01,    //   Usage (My Computer) ; bit 0: 1
  USAGE(2),           0x92, 0x01,    //   Usage (Calculator)  ; bit 1: 2
  USAGE(2),           0x2A, 0x02,    //   Usage (WWW fav)     ; bit 2: 4
  USAGE(2),           0x21, 0x02,    //   Usage (WWW search)  ; bit 3: 8
  USAGE(2),           0x26, 0x02,    //   Usage (WWW stop)    ; bit 4: 16
  USAGE(2),           0x24, 0x02,    //   Usage (WWW back)    ; bit 5: 32
  USAGE(2),           0x83, 0x01,    //   Usage (Media sel)   ; bit 6: 64
  USAGE(2),           0x8A, 0x01,    //   Usage (Mail)        ; bit 7: 128
  HIDINPUT(1),        0x02,          //   INPUT (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
  END_COLLECTION(0)                  // END_COLLECTION
};

static DescriptorCallbacks dscCallbacks;
static CharacteristicCallbacks chrCallbacks;

BleKeyboard::BleKeyboard(std::string deviceName, std::string deviceManufacturer, uint8_t batteryLevel) : hid(0)
{
  this->deviceName = deviceName;
  this->deviceManufacturer = deviceManufacturer;
  this->batteryLevel = batteryLevel;
  this->connectionStatus = new BleConnectionStatus();
  this->keyboard_language = 0;
}

void BleKeyboard::begin(void)
{
  xTaskCreate(this->taskServer, "server", 20000, (void *)this, 5, NULL);
}

void BleKeyboard::end(void)
{
}

bool BleKeyboard::isConnected(void) {
  return this->connectionStatus->connected;
}

void BleKeyboard::setBatteryLevel(uint8_t level) {
  this->batteryLevel = level;
  // if (hid != 0)
  //   this->hid->setBatteryLevel(this->batteryLevel);
}



void BleKeyboard::taskServer(void* pvParameter) {

   BleKeyboard* bleKeyboardInstance = (BleKeyboard *) pvParameter; //static_cast<BleKeyboard *>(pvParameter);

    /** sets device name */
    NimBLEDevice::init(bleKeyboardInstance->deviceName);
    NimBLEDevice::setPower(ESP_PWR_LVL_P9); /** +9db */
    NimBLEDevice::setSecurityAuth(BLE_SM_PAIR_AUTHREQ_BOND);

    NimBLEServer* pServer = NimBLEDevice::createServer();
    pServer->setCallbacks(bleKeyboardInstance->connectionStatus);

    //DeviceInfoService
    NimBLEService* pDeviceInfoService = pServer->createService("180A"); // <-デバイスインフォのUUID
    NimBLECharacteristic* pPnpCharacteristic = pDeviceInfoService->createCharacteristic("2A50", NIMBLE_PROPERTY::READ);
    uint8_t sig = 0x02;
    uint16_t vid = 0xe502;
    uint16_t pid = 0xa111;
    uint16_t version = 0x0210; 
    uint8_t pnp[] = { sig, (uint8_t) (vid >> 8), (uint8_t) vid, (uint8_t) (pid >> 8), (uint8_t) pid, (uint8_t) (version >> 8), (uint8_t) version };
    pPnpCharacteristic->setValue(pnp, sizeof(pnp));
    pPnpCharacteristic->setCallbacks(&chrCallbacks);

    //DeviceInfoService-Manufacturer
    NimBLECharacteristic* pManufacturerCharacteristic = pDeviceInfoService->createCharacteristic("2A29", NIMBLE_PROPERTY::READ); // 0x2a29 = メーカー名
    pManufacturerCharacteristic->setValue(bleKeyboardInstance->deviceManufacturer);
    pManufacturerCharacteristic->setCallbacks(&chrCallbacks);

    //HidService
    NimBLEService* pHidService = pServer->createService(NimBLEUUID("1812"), 40);

    //HidService-hidInfo
    NimBLECharacteristic* pHidInfoCharacteristic = pHidService->createCharacteristic("2A4A", NIMBLE_PROPERTY::READ);// HID Information 会社名？とか？あと何かのフラグ
    uint8_t country = 0x00;
    uint8_t flags = 0x01;
    uint8_t info[] = { 0x11, 0x1, country, flags };                                              
    pHidInfoCharacteristic->setValue(info, sizeof(info));
    pHidInfoCharacteristic->setCallbacks(&chrCallbacks);

    //HidService-reportMap
    NimBLECharacteristic* pReportMapCharacteristic = pHidService->createCharacteristic("2A4B",NIMBLE_PROPERTY::READ); // HID Report Map (ここでHIDのいろいろ設定
    pReportMapCharacteristic->setValue((uint8_t*)_hidReportDescriptor, sizeof(_hidReportDescriptor));
    pReportMapCharacteristic->setCallbacks(&chrCallbacks);

    //HidService-HidControl
    NimBLECharacteristic* pHidControlCharacteristic = pHidService->createCharacteristic("2A4C", NIMBLE_PROPERTY::WRITE_NR);// HID Control Point
    pHidControlCharacteristic->setCallbacks(&chrCallbacks);

    //HidService-protocolMode
    NimBLECharacteristic* pProtocolModeCharacteristic = pHidService->createCharacteristic("2A4E",NIMBLE_PROPERTY::WRITE_NR | NIMBLE_PROPERTY::READ); // Protocol Mode
    const uint8_t pMode[] = { 0x01 }; // 0: Boot Protocol 1: Rport Protocol
    pProtocolModeCharacteristic->setValue((uint8_t*) pMode, 1);
    pProtocolModeCharacteristic->setCallbacks(&chrCallbacks);

    //HidService-input
    NimBLECharacteristic* pInputCharacteristic = pHidService->createCharacteristic("2A4D", NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY | NIMBLE_PROPERTY::READ_ENC | NIMBLE_PROPERTY::WRITE_ENC); // Report
    NimBLEDescriptor* pC01Ddsc = pInputCharacteristic->createDescriptor( "2908", NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY | NIMBLE_PROPERTY::READ_ENC | NIMBLE_PROPERTY::WRITE_ENC, 20); // Report Reference
    uint8_t desc1_val[] = { 0x01, 0x01 }; // Report ID 1 を Input に設定
    pC01Ddsc->setValue((uint8_t*) desc1_val, 2);
    pC01Ddsc->setCallbacks(&dscCallbacks);

    //HidService-input2 media port
    NimBLECharacteristic* pInputCharacteristic2 = pHidService->createCharacteristic("2A4D", NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY | NIMBLE_PROPERTY::READ_ENC | NIMBLE_PROPERTY::WRITE_ENC); // Report
    NimBLEDescriptor* pC01Ddsc2 = pInputCharacteristic2->createDescriptor("2908", NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY | NIMBLE_PROPERTY::READ_ENC | NIMBLE_PROPERTY::WRITE_ENC, 20);
    uint8_t desc1_val2[] = { 0x02, 0x01 }; // Report ID 2 を Input に設定
    pC01Ddsc2->setValue((uint8_t*) desc1_val2, 2);
    pC01Ddsc2->setCallbacks(&dscCallbacks);

    // HidService-output
    NimBLECharacteristic* pOutputCharacteristic = pHidService->createCharacteristic("2A4D", NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::WRITE | NIMBLE_PROPERTY::WRITE_NR | NIMBLE_PROPERTY::READ_ENC | NIMBLE_PROPERTY::WRITE_ENC);
    pOutputCharacteristic->setCallbacks(new KeyboardOutputCallbacks());
    NimBLEDescriptor* pDesc3 = pOutputCharacteristic->createDescriptor("2908", NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY | NIMBLE_PROPERTY::READ_ENC | NIMBLE_PROPERTY::WRITE_ENC, 20);
    uint8_t desc1_val3[] = { 0x01, 0x02}; // Report ID 1 を Output に設定
    pDesc3->setValue((uint8_t*) desc1_val3, 2);

    //BatteryService
    NimBLEService* pBatteryService = pServer->createService("180F");
    NimBLECharacteristic* pBatteryLevelCharacteristic = pBatteryService->createCharacteristic("2A19", NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY);
    NimBLE2904* pBatteryLevelDescriptor = (NimBLE2904*)pBatteryLevelCharacteristic->createDescriptor("2904"); 
    pBatteryLevelDescriptor->setFormat(NimBLE2904::FORMAT_UTF8);
    pBatteryLevelDescriptor->setNamespace(1);
    pBatteryLevelDescriptor->setUnit(0x27ad);
    pBatteryLevelDescriptor->setCallbacks(&dscCallbacks);

    /** Start the services when finished creating all Characteristics and Descriptors */
    pDeviceInfoService->start();
    pHidService->start();
    pBatteryService->start();

    NimBLEAdvertising* pAdvertising = NimBLEDevice::getAdvertising();
    pAdvertising->setAppearance(HID_KEYBOARD); //HID_KEYBOARD / HID_MOUSE
    pAdvertising->addServiceUUID(pHidService->getUUID());
    pAdvertising->setScanResponse(true);
    pAdvertising->start();

    bleKeyboardInstance->inputKeyboard = pInputCharacteristic;
    bleKeyboardInstance->inputMediaKeys = pInputCharacteristic2;
    bleKeyboardInstance->outputKeyboard = pOutputCharacteristic;


  ESP_LOGD(LOG_TAG, "Advertising started!");
  vTaskDelay(portMAX_DELAY); //delay(portMAX_DELAY);
}

void BleKeyboard::sendReport(KeyReport* keys)
{
  if (this->isConnected())
  {
    this->inputKeyboard->setValue((uint8_t*)keys, sizeof(KeyReport));
    this->inputKeyboard->notify();
  }
}

void BleKeyboard::sendReport(MediaKeyReport* keys)
{
  if (this->isConnected())
  {
    this->inputMediaKeys->setValue((uint8_t*)keys, sizeof(MediaKeyReport));
    this->inputMediaKeys->notify();
  }
}

const unsigned short _asciimap[128] PROGMEM =
{
	// 0x00
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x28,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,

	// 0x10
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,
	0x00,

	// 0x20
	0x2c, // ' '
	0x1e | SHIFT, // !
	0x1f | SHIFT, // "
	0x20 | SHIFT, // #
	0x21 | SHIFT, // $
	0x22 | SHIFT, // %
	0x23 | SHIFT, // &
	0x24 | SHIFT, // '
	0x25 | SHIFT, // (
	0x26 | SHIFT, // )
	0x34 | SHIFT, // *
	0x33 | SHIFT, // +
	0x36, // ,
	0x2d, // -
	0x37, // .
	0x38, // /

	// 0x30
	0x27, // 0
	0x1e, // 1
	0x1f, // 2
	0x20, // 3
	0x21, // 4
	0x22, // 5
	0x23, // 6
	0x24, // 7
	0x25, // 8
	0x26, // 9
	0x34, // :
	0x33, // ;
	0x36 | SHIFT, // <
	0x2d | SHIFT, // =
	0x37 | SHIFT, // >
	0x38 | SHIFT, // ?

	// 0x40
	0x2f, // @
	0x04 | SHIFT, // A
	0x05 | SHIFT, // B
	0x06 | SHIFT, // C
	0x07 | SHIFT, // D
	0x08 | SHIFT, // E
	0x09 | SHIFT, // F
	0x0a | SHIFT, // G
	0x0b | SHIFT, // H
	0x0c | SHIFT, // I
	0x0d | SHIFT, // J
	0x0e | SHIFT, // K
	0x0f | SHIFT, // L
	0x10 | SHIFT, // M
	0x11 | SHIFT, // N
	0x12 | SHIFT, // O
	
	// 0x50
	0x13 | SHIFT, // P
	0x14 | SHIFT, // Q
	0x15 | SHIFT, // R
	0x16 | SHIFT, // S
	0x17 | SHIFT, // T
	0x18 | SHIFT, // U
	0x19 | SHIFT, // V
	0x1a | SHIFT, // W
	0x1b | SHIFT, // X
	0x1c | SHIFT, // Y
	0x1d | SHIFT, // Z
	0x30, // [
	0x89, // yen
	0x32, // ]
	0x2e, // ^
	0x87 | SHIFT, // _

	// 0x60
	0x2f | SHIFT, // `
	0x04, // a
	0x05, // b
	0x06, // c
	0x07, // d
	0x08, // e
	0x09, // f
	0x0a, // g
	0x0b, // h
	0x0c, // i
	0x0d, // j
	0x0e, // k
	0x0f, // l
	0x10, // m
	0x11, // n
	0x12, // o

	// 0x70
	0x13, // p
	0x14, // q
	0x15, // r
	0x16, // s
	0x17, // t
	0x18, // u
	0x19, // v
	0x1a, // w
	0x1b, // x
	0x1c, // y
	0x1d, // z
	0x30 | SHIFT, // {
	0x89 | SHIFT, // |
	0x32 | SHIFT, // }
	0x2e | SHIFT, // ~
	
	0				// DEL
};


// ble code [jis -> us]
const unsigned short _codemap_us[64] PROGMEM =
{
	4127, 4148, // "
	47, 4127, // @
	46, 4131, // ^
	4131, 4132, // &
	4132, 52, // '
	4148, 4133, // *
	4133, 4134, // (
	4134, 4135, // )
	4141, 46, // =
	4231, 4141, // _
	4147, 4142, // +
	48, 47, // [
	4144, 4143, // {
	50, 48, // ]
	4146, 4144, // }
	135, 49, // yen
	137, 49, // yen
	4233, 4145, // |
	52, 4147, // :
	4143, 53, // `
	4142, 4149, // ~
	0, 0
};


uint8_t USBPutChar(uint8_t c);

// press() adds the specified key (printing, non-printing, or modifier)
// to the persistent key report and sends the report.  Because of the way
// USB HID works, the host acts like the key remains pressed until we
// call release(), releaseAll(), or otherwise clear the report and resend.
size_t BleKeyboard::press(uint8_t k)
{
	uint8_t i;
	unsigned short kk;
	kk = code_convert(_asciimap[k]);
	if (!kk) {
		setWriteError();
		return 0;
	}
	if (kk & SHIFT) {						// it's a capital letter or other character reached with shift
		_keyReport.modifiers |= 0x02;	// the left shift modifier
		kk &= 0xFF;
	}

	// Add k to the key report only if it's not already present
	// and if there is an empty slot.
	if (_keyReport.keys[0] != kk && _keyReport.keys[1] != kk &&
		_keyReport.keys[2] != kk && _keyReport.keys[3] != kk &&
		_keyReport.keys[4] != kk && _keyReport.keys[5] != kk) {

		for (i=0; i<6; i++) {
			if (_keyReport.keys[i] == 0x00) {
				_keyReport.keys[i] = kk;
				break;
			}
		}
		if (i == 6) {
			setWriteError();
			return 0;
		}
	}
	sendReport(&_keyReport);
	return 1;
}

size_t BleKeyboard::press(const MediaKeyReport k)
{
    uint16_t k_16 = k[1] | (k[0] << 8);
    uint16_t mediaKeyReport_16 = _mediaKeyReport[1] | (_mediaKeyReport[0] << 8);

    mediaKeyReport_16 |= k_16;
    _mediaKeyReport[0] = (uint8_t)((mediaKeyReport_16 & 0xFF00) >> 8);
    _mediaKeyReport[1] = (uint8_t)(mediaKeyReport_16 & 0x00FF);

	sendReport(&_mediaKeyReport);
	return 1;
}

size_t BleKeyboard::press_set(uint8_t k)
{
	uint8_t i;
	unsigned short kk;
	kk = code_convert(_asciimap[k]);
	if (!kk) {
		setWriteError();
		return 0;
	}
	if (kk & SHIFT) {
		_keyReport.modifiers = 0x02;
	} else {
		_keyReport.modifiers = 0x00;
	}
	kk &= 0xFF;
	_keyReport.keys[0] = kk;
	_keyReport.keys[1] = 0x00;
	_keyReport.keys[2] = 0x00;
	_keyReport.keys[3] = 0x00;
	_keyReport.keys[4] = 0x00;
	_keyReport.keys[5] = 0x00;

	sendReport(&_keyReport);
	return 1;
}

unsigned short BleKeyboard::code_convert(unsigned short k)
{
	short i = 0;
	if (this->keyboard_language == 1) {
		while (_codemap_us[i] && i < 63) {
			if (_codemap_us[i] == k) {
				return _codemap_us[i + 1];
			}
			i += 2;
		}
	}
	return k;
}

size_t BleKeyboard::press_raw(unsigned short k)
{
	uint8_t i;
	unsigned short kk;
	kk = code_convert(k);
	ESP_LOGD(LOG_TAG, "press_raw: %D", kk);
	if (kk & SHIFT) {
		_keyReport.modifiers |= 0x02;
		kk &= 0xFF;
		ESP_LOGD(LOG_TAG, "press_raw: %D on shift", kk);
	}
	ESP_LOGD(LOG_TAG, "press_raw modifiers: %D", _keyReport.modifiers);
	if (_keyReport.keys[0] != kk && _keyReport.keys[1] != kk &&
		_keyReport.keys[2] != kk && _keyReport.keys[3] != kk &&
		_keyReport.keys[4] != kk && _keyReport.keys[5] != kk) {

		for (i=0; i<6; i++) {
			if (_keyReport.keys[i] == 0x00) {
				_keyReport.keys[i] = kk;
				break;
			}
		}
		if (i == 6) {
			setWriteError();
			return 0;
		}
	}
	sendReport(&_keyReport);
	return 1;
}

// release() takes the specified key out of the persistent key report and
// sends the report.  This tells the OS the key is no longer pressed and that
// it shouldn't be repeated any more.
size_t BleKeyboard::release(uint8_t k)
{
	uint8_t i;
	unsigned short kk;
	kk = code_convert(_asciimap[k]);
	if (!kk) {
		return 0;
	}
	if (kk & SHIFT) {							// it's a capital letter or other character reached with shift
		_keyReport.modifiers &= ~(0x02);	// the left shift modifier
		kk &= 0xFF;
	}

	
	// Test the key report to see if k is present.  Clear it if it exists.
	// Check all positions in case the key is present more than once (which it shouldn't be)
	for (i=0; i<6; i++) {
		if (0 != kk && _keyReport.keys[i] == kk) {
			_keyReport.keys[i] = 0x00;
		}
	}

	sendReport(&_keyReport);
	return 1;
}

size_t BleKeyboard::release(const MediaKeyReport k)
{
    uint16_t k_16 = k[1] | (k[0] << 8);
    uint16_t mediaKeyReport_16 = _mediaKeyReport[1] | (_mediaKeyReport[0] << 8);
    mediaKeyReport_16 &= ~k_16;
    _mediaKeyReport[0] = (uint8_t)((mediaKeyReport_16 & 0xFF00) >> 8);
    _mediaKeyReport[1] = (uint8_t)(mediaKeyReport_16 & 0x00FF);

	sendReport(&_mediaKeyReport);
	return 1;
}

size_t BleKeyboard::release_raw(unsigned short k)
{
	uint8_t i;
	unsigned short kk;
	kk = code_convert(k);
	if (kk & SHIFT) {
		_keyReport.modifiers &= ~0x02;
		kk &= 0xFF;
	}

	// Test the key report to see if k is present.  Clear it if it exists.
	// Check all positions in case the key is present more than once (which it shouldn't be)
	for (i=0; i<6; i++) {
		if (0 != kk && _keyReport.keys[i] == kk) {
			_keyReport.keys[i] = 0x00;
		}
	}

	sendReport(&_keyReport);
	return 1;
}

void BleKeyboard::releaseAll(void)
{
	_keyReport.keys[0] = 0;
	_keyReport.keys[1] = 0;
	_keyReport.keys[2] = 0;
	_keyReport.keys[3] = 0;
	_keyReport.keys[4] = 0;
	_keyReport.keys[5] = 0;
	_keyReport.modifiers = 0;
    _mediaKeyReport[0] = 0;
    _mediaKeyReport[1] = 0;
	sendReport(&_keyReport);
}

void BleKeyboard::set_keyboard_language(uint8_t kl)
{
  this->keyboard_language = kl;
}

size_t BleKeyboard::write(uint8_t c)
{
	uint8_t p = press(c);  // Keydown
	release(c);            // Keyup
	return p;              // just return the result of press() since release() almost always returns 1
}

size_t BleKeyboard::write(const MediaKeyReport c)
{
	uint16_t p = press(c);  // Keydown
	release(c);            // Keyup
	return p;              // just return the result of press() since release() almost always returns 1
}

size_t BleKeyboard::write(const uint8_t *buffer, size_t size) {
	size_t n = 0;
	while (size--) {
		if (*buffer != '\r') {
			if (write(*buffer)) {
			  n++;
			} else {
			  break;
			}
		}
		buffer++;
	}
	return n;
}
